In [11]:
import pandas as pd
import csv

In [12]:
df = pd.read_csv("default.csv")
df.head()

,Unnamed: 0,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
2,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
3,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
4,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0

In [13]:
df["Y"].value_counts()

Y
0                             23364
1                              6636
default payment next month        1
Name: count, dtype: int64

In [14]:
df.iloc[0]

Unnamed: 0                            ID
X1                             LIMIT_BAL
X2                                   SEX
X3                             EDUCATION
X4                              MARRIAGE
X5                                   AGE
X6                                 PAY_0
X7                                 PAY_2
X8                                 PAY_3
X9                                 PAY_4
X10                                PAY_5
X11                                PAY_6
X12                            BILL_AMT1
X13                            BILL_AMT2
X14                            BILL_AMT3
X15                            BILL_AMT4
X16                            BILL_AMT5
X17                            BILL_AMT6
X18                             PAY_AMT1
X19                             PAY_AMT2
X20                             PAY_AMT3
X21                             PAY_AMT4
X22                             PAY_AMT5
X23                             PAY_AMT6
Y             default payment next month
Name: 0, dtype: object

In [15]:
df["X1"].value_counts()

X1
50000        3365
20000        1976
30000        1610
80000        1567
200000       1528
             ...
327680          1
760000          1
690000          1
1000000         1
LIMIT_BAL       1
Name: count, Length: 82, dtype: int64

In [16]:
df["X2"].value_counts()

X2
2      18112
1      11888
SEX        1
Name: count, dtype: int64

In [17]:
df["X3"].value_counts()

X3
2            14030
1            10585
3             4917
5              280
4              123
6               51
0               14
EDUCATION        1
Name: count, dtype: int64

In [18]:
df["X4"].value_counts()

X4
2           15964
1           13659
3             323
0              54
MARRIAGE        1
Name: count, dtype: int64

In [19]:
df["X12"].value_counts()

X12
0         2008
390        244
780         76
326         72
316         63
          ...
11636        1
146034       1
20817        1
1351         1
47929        1
Name: count, Length: 22724, dtype: int64

In [20]:
f = open("default.csv")
reader = csv.reader(f, delimiter=",")

header = next(reader)
header = next(reader)  # This file has two headers

# Read the data and extract label and sensitive attributes
dataAttributeLabel = []
for row in reader:
    d = dict(zip(header, row))
    label = d["default payment next month"] == "1"
    attribute = d["EDUCATION"] == "1"
    del d["default payment next month"]
    del d["EDUCATION"]
    dataAttributeLabel.append((d, attribute, label))

print(d)
print(attribute)
print(label)

{'ID': '30000', 'LIMIT_BAL': '50000', 'SEX': '1', 'MARRIAGE': '1', 'AGE': '46', 'PAY_0': '0', 'PAY_2': '0', 'PAY_3': '0', 'PAY_4': '0', 'PAY_5': '0', 'PAY_6': '0', 'BILL_AMT1': '47929', 'BILL_AMT2': '48905', 'BILL_AMT3': '49764', 'BILL_AMT4': '36535', 'BILL_AMT5': '32428', 'BILL_AMT6': '15313', 'PAY_AMT1': '2078', 'PAY_AMT2': '1800', 'PAY_AMT3': '1430', 'PAY_AMT4': '1000', 'PAY_AMT5': '1000', 'PAY_AMT6': '1000'}
False
True